Revit 2020 API
MEPModel.AssignedElectricalSystems Property
Retrieves the electrical systems this electrical panel currently is assigned to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public ElectricalSystemSet AssignedElectricalSystems { get; }
Visual Basic
Public ReadOnly Property AssignedElectricalSystems As ElectricalSystemSet
	Get
Visual C++
public:
property ElectricalSystemSet^ AssignedElectricalSystems {
	ElectricalSystemSet^ get ();
}
Remarks
This property returns a set of Electrical Systems. If there are no electrical systems created for this model, this property will be an empty set.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace